import React from "react";
import "./Signs.css";
import snow from '../../img/snow.jpg';
import flowers from '../../img/flowers.jpg';
import sun from '../../img/sun.jpg';
import mushrooms from '../../img/mushrooms.jpg';

const Signs = () => (
    <div className='signsInfo'>

        <div className='singsWinter'>
            <h2>Прикмети на зиму</h2>
            <img src={snow} className="" alt="" />
            <p>• Снiгур спiває - на снiг, завiрюху.</p>
            <p>• Зірки блищать яскраво - до морозів, мало їх на небі - чекай негоди.</p>
            <p>• Якщо взимку сухо і холодно, влітку сухо і жарко.</p>
            <p>• Кішка на печі – до холоднечі; а кішка на підлозі – до тепла.</p>
            <p>• Зима сніжна – літо дощове.</p>
            <p>• Довгі сухі ялинові гілочки до хуртовини згинаються, на гарну погоду розпрямляються.</p>
            <p>• Дим стовпом – до морозу. </p>
            <p>• Снігур під вікном взимку цвірінькає – до відлиги.</p>
        </div>

        <div>
            <h2>Прикмети на весну</h2>
            <img src={flowers} className="" alt="" />
            <p>• Довгі бурульки – до довгої весни.</p>
            <p>• Якщо ранньою весною блискає блискавка, а грому не чути – літо буде сухим.</p>
            <p>• Квітень з водою, а травень з травою.</p>
            <p>• Ранній приліт граків і жайворонків – до теплої весни.</p>
            <p>• Птахи в'ють гнізда на сонячній стороні – до холодного літа.</p>
            <p>• З берези тече багато соку – до дощового літа.</p>
            <p>• Якщо ранньою весною блискає блискавка, а грому не чути – літо буде сухим.</p>
            <p>• У квітні ранковий туман віщує ясну і теплу погоду вдень.</p>
        </div>

        <div>
            <h2>Прикмети на літо</h2>
            <img src={sun} className="" alt="" /> <p>• Дуже пахнуть квіти жовтої акації, в'ються над ними хмари комах – на дощ і негоду.</p>
            <p>• Ясний чумацький шлях – на гарну погоду.</p>
            <p>• Влітку горобці літають купами — на суху і ясну погоду.</p>
            <p>• Духота під час гарної погоди, птахи перестають співати — до грози.</p>
            <p>• Влітку ліс без вітру шумить – на дощ, перед грозою – затихає.</p>
            <p>• Сире літо і тепла осінь — до довгої зими.</p>
            <p>• Якщо півень влітку заспівав раніше 9 години вечора — на дощ.</p>
            <p>• Чистий захід сонця – ознака стійкої ясної погоди.</p>
        </div>

        <div>
            <h2>Прикмети на осінь</h2>
            <img src={mushrooms} className="" alt="" />
            <p>• Тепла осінь – до затяжної зими.</p>
            <p>• Якщо влітку на деревах рано жовтіє листя, то буде рання осінь.</p>
            <p>• Передчасний листопад – до ранньої зими.</p>
            <p>• Якщо листя з дерев нечисто опадає (тобто частина листя залишається на гілках), то зима буде холодна.</p>
            <p>• Якщо восени березове листя починають з верхівки дерева жовтіти, то весна буде рання, а якщо знизу – пізня.</p>
            <p>• Велика кількість жолудів на дубі – до теплої зими та родючого літа.2</p>
            <p>• Пізній гриб – до пізнього снігу.</p>
            <p>•Низько летять перелітні птахи – до короткої осені. </p>
        </div>
    </div>
)

export default Signs;